SoapRequestSamples/SimilaritySearchRequestSample.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
	<SOAP-ENV:Body>
		<namesp1:SimilaritySearchRequest xmlns:namesp1="urn:PI/DevCentral/SoapService">
			<SimilaritySearchRequest xsi:type="m:SimilarityRequest">
				<asin >B000067RPH</asin>
				<page >1</page>
				<mode >music</mode>
				<tag >your-associate-tag</tag>
				<type >lite</type>
				<dev-tag >your-dev-tag</dev-tag>
				<format >xml</format>
				<version >1.0</version>
			</SimilaritySearchRequest>
		</namesp1:SimilaritySearchRequest>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
